-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 22, 2021 at 10:13 AM
-- Server version: 10.4.18-MariaDB
-- PHP Version: 7.4.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `radius`
--

-- --------------------------------------------------------

--
-- Table structure for table `customer`
--

CREATE TABLE `customer` (
  `ssn` varchar(13) NOT NULL,
  `fname` varchar(100) NOT NULL,
  `lname` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `customer_register`
--

CREATE TABLE `customer_register` (
  `id` int(11) NOT NULL,
  `ssn` char(13) DEFAULT NULL,
  `register_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `customer_register`
--

INSERT INTO `customer_register` (`id`, `ssn`, `register_time`) VALUES
(1, '1309902628375', '2020-06-01 07:02:30'),
(2, '1309902628375', '2020-01-01 07:02:36'),
(3, '1309902628375', '2020-01-02 07:02:36'),
(4, '1309902628375', '2020-01-03 07:02:36'),
(5, '1309902628375', '2020-01-04 07:02:36'),
(6, '1309902628375', '2020-01-05 07:02:36'),
(7, '1309902628375', '2020-01-05 07:02:36'),
(8, '1309902628375', '2020-01-05 07:02:36'),
(9, '1309902628375', '2020-01-05 07:02:36'),
(10, '1309902628375', '2020-01-05 07:02:36'),
(11, '1309902628375', '2020-01-05 07:02:36'),
(12, '1309902628375', '2020-01-06 07:02:36'),
(13, '1309902628375', '2020-01-06 07:02:36'),
(14, '1309902628375', '2020-01-06 07:02:36'),
(15, '1309902628375', '2020-01-07 07:02:36'),
(16, '1309902628375', '2020-01-07 07:02:36'),
(17, '1309902628375', '2020-01-07 07:02:36'),
(18, '1309902628375', '2020-01-07 07:02:36'),
(19, '1309902628374', '2020-01-30 07:02:36'),
(20, '1309902628374', '2020-01-07 07:02:36'),
(21, '1309902628374', '2020-01-07 07:02:36'),
(22, '1309902628374', '2020-01-07 07:02:36'),
(23, '1309902628374', '2020-01-07 07:02:36'),
(24, '1309902628374', '2020-01-07 07:02:36'),
(25, '1309902628374', '2020-01-07 07:02:36'),
(26, '1309902628374', '2020-01-07 07:02:36'),
(27, '1309902628374', '2020-01-07 07:02:36'),
(28, '1309902628374', '2020-01-07 07:02:36'),
(29, '1309902628374', '2020-01-07 07:02:36'),
(30, '1309902628374', '2020-02-07 07:02:36'),
(31, '1309902628374', '2020-02-07 07:02:36'),
(32, '1309902628374', '2020-02-07 07:02:36'),
(33, '1309902628374', '2020-02-07 07:02:36'),
(34, '1309902628374', '2020-02-07 07:02:36'),
(35, '1309902628374', '2020-02-07 07:02:36'),
(36, '1309902628374', '2020-02-08 07:02:36'),
(37, '1309902628374', '2020-02-08 07:02:36'),
(38, '1309902628373', '2020-03-08 07:02:36'),
(39, '1309902628373', '2020-03-08 07:02:36'),
(40, '1309902628373', '2020-03-08 07:02:36'),
(41, '1309902628373', '2020-03-08 07:02:36'),
(42, '1309902628373', '2020-03-08 07:02:36'),
(43, '1309902628373', '2020-03-08 07:02:36'),
(44, '1309902628373', '2020-03-08 07:02:36'),
(45, '1309902628373', '2020-03-08 07:02:36'),
(46, '1309902628373', '2020-03-08 07:02:36'),
(47, '1309902628373', '2020-03-08 07:02:36'),
(48, '1309902628373', '2020-03-08 07:02:36'),
(49, '1309902628373', '2020-03-08 07:02:36'),
(50, '1309902628373', '2020-03-08 07:02:36'),
(51, '1309902628373', '2020-03-08 07:02:36'),
(52, '1309902628373', '2020-03-09 07:02:36'),
(53, '1309902628373', '2020-03-09 07:02:36'),
(54, '1309902628373', '2020-03-09 07:02:36'),
(55, '1309902628373', '2020-03-09 07:02:36'),
(56, '1309902628373', '2020-03-09 07:02:36'),
(57, '1309902628372', '2020-03-09 07:02:36'),
(58, '1309902628372', '2020-03-09 07:02:36'),
(59, '1309902628372', '2020-03-09 07:02:36'),
(60, '1309902628372', '2020-03-09 07:02:36'),
(61, '1309902628372', '2020-04-09 07:02:36'),
(62, '1309902628372', '2020-04-09 07:02:36'),
(63, '1309902628372', '2020-04-09 07:02:36'),
(64, '1309902628372', '2020-04-09 07:02:36'),
(65, '1309902628372', '2020-04-09 07:02:36'),
(66, '1309902628372', '2020-04-10 07:02:36'),
(67, '1309902628372', '2020-04-10 07:02:36'),
(68, '1309902628372', '2020-04-10 07:02:36'),
(69, '1309902628372', '2020-04-10 07:02:36'),
(70, '1309902628372', '2020-04-10 07:02:36'),
(71, '1309902628372', '2020-04-10 07:02:36'),
(72, '1309902628372', '2020-04-10 07:02:36'),
(73, '1309902628372', '2020-04-10 07:02:36'),
(74, '1309902628372', '2020-04-10 07:02:36'),
(75, '1309902628372', '2020-04-10 07:02:36'),
(76, '1309902628371', '2020-04-10 07:02:36'),
(77, '1309902628371', '2020-04-10 07:02:36'),
(78, '1309902628371', '2020-04-10 07:02:36'),
(79, '1309902628371', '2020-04-10 07:02:36'),
(80, '1309902628371', '2020-04-10 07:02:36'),
(81, '1309902628371', '2020-04-11 07:02:30'),
(82, '1309902628371', '2020-04-11 07:02:31'),
(83, '1309902628371', '2020-04-11 07:02:32'),
(84, '1309902628371', '2020-04-11 07:02:33'),
(85, '1309902628371', '2020-05-11 07:02:34'),
(86, '1309902628371', '2020-05-11 07:02:35'),
(87, '1309902628371', '2020-05-11 07:02:36'),
(88, '1309902628371', '2020-05-11 07:02:37'),
(89, '1309902628371', '2020-05-11 07:02:38'),
(90, '1309902628371', '2020-05-12 07:02:36'),
(91, '1309902628371', '2020-05-13 07:02:36'),
(92, '1309902628371', '2020-05-14 07:02:36'),
(93, '1309902628371', '2020-05-15 07:02:36'),
(94, '1309902628371', '2020-05-16 07:02:36'),
(95, '1309902628372', '2019-05-17 07:02:36'),
(96, '1309902628372', '2019-05-18 07:02:36'),
(97, '1309902628372', '2019-05-19 07:02:36'),
(98, '1309902628372', '2019-05-20 07:02:36'),
(99, '1309902628372', '2019-05-21 07:02:30'),
(100, '1309902628372', '2019-05-21 07:02:31'),
(101, '1309902628372', '2019-05-21 07:02:32'),
(102, '1309902628372', '2019-05-21 07:02:33'),
(103, '1309902628372', '2019-05-21 07:02:34'),
(104, '1309902628372', '2019-05-21 07:02:35'),
(105, '1309902628372', '2019-05-21 07:02:36'),
(106, '1309902628372', '2019-05-21 07:02:37'),
(107, '1309902628372', '2019-05-21 07:02:38'),
(108, '1309902628372', '2019-05-21 07:02:39'),
(109, '1309902628372', '2019-05-21 07:02:36'),
(110, '1309902628372', '2019-05-21 07:02:36'),
(111, '1309902628372', '2019-05-25 07:02:36'),
(112, '1309902628372', '2019-05-26 07:02:36'),
(113, '1309902628372', '2019-05-26 07:02:36'),
(114, '1309902628371', '2019-05-26 07:02:36'),
(115, '1309902628371', '2019-05-26 07:02:36'),
(116, '1309902628371', '2019-05-26 07:02:36'),
(117, '1309902628371', '2019-05-26 07:02:36'),
(118, '1309902628371', '2019-05-26 07:02:36'),
(119, '1309902628371', '2019-05-27 07:02:36'),
(120, '1309902628371', '2019-05-27 07:02:36'),
(121, '1309902628371', '2019-05-27 07:02:36'),
(122, '1309902628371', '2019-05-27 07:02:36'),
(123, '1309902628371', '2019-05-27 07:02:36'),
(124, '1309902628371', '2019-05-28 07:02:36'),
(125, '1309902628371', '2019-05-29 07:02:36'),
(126, '1309902628371', '2019-05-29 07:02:36'),
(127, '1309902628371', '2019-05-29 07:02:36'),
(128, '1309902628371', '2019-05-30 07:02:36'),
(129, '1309902628375', '2020-06-01 07:02:36'),
(130, '1309902628375', '2020-06-01 07:02:36'),
(131, '1309902628375', '2020-06-02 07:02:36'),
(132, '1309902628375', '2020-06-03 07:02:36'),
(133, '1309902628375', '2020-06-04 07:02:36'),
(134, '1309902628375', '2020-06-05 07:02:36'),
(135, '1309902628375', '2020-06-05 07:02:36'),
(136, '1309902628375', '2020-06-05 07:02:36'),
(137, '1309902628375', '2020-06-05 07:02:36'),
(138, '1309902628375', '2020-06-05 07:02:36'),
(139, '1309902628375', '2020-06-05 07:02:36'),
(140, '1309902628375', '2020-06-06 07:02:36'),
(141, '1309902628375', '2020-06-06 07:02:36'),
(142, '1309902628375', '2020-06-06 07:02:36'),
(143, '1309902628375', '2020-06-07 07:02:36'),
(144, '1309902628375', '2020-06-07 07:02:36'),
(145, '1309902628375', '2020-06-07 07:02:36'),
(146, '1309902628375', '2020-06-07 07:02:36'),
(147, '1309902628374', '2020-06-30 07:02:36'),
(148, '1309902628374', '2020-06-07 07:02:36'),
(149, '1309902628374', '2020-06-07 07:02:36'),
(150, '1309902628374', '2020-06-07 07:02:36'),
(151, '1309902628374', '2020-07-07 07:02:36'),
(152, '1309902628374', '2020-07-07 07:02:36'),
(153, '1309902628374', '2020-07-07 07:02:36'),
(154, '1309902628374', '2020-07-07 07:02:36'),
(155, '1309902628374', '2020-07-07 07:02:36'),
(156, '1309902628374', '2020-07-07 07:02:36'),
(157, '1309902628374', '2020-07-07 07:02:36'),
(158, '1309902628374', '2020-07-07 07:02:36'),
(159, '1309902628374', '2020-07-07 07:02:36'),
(160, '1309902628374', '2020-07-07 07:02:36'),
(161, '1309902628374', '2020-07-07 07:02:36'),
(162, '1309902628374', '2020-07-07 07:02:36'),
(163, '1309902628374', '2020-07-07 07:02:36'),
(164, '1309902628374', '2020-07-08 07:02:36'),
(165, '1309902628374', '2020-07-08 07:02:36'),
(166, '1309902628373', '2020-07-08 07:02:36'),
(167, '1309902628373', '2020-07-08 07:02:36'),
(168, '1309902628373', '2020-07-08 07:02:36'),
(169, '1309902628373', '2020-07-08 07:02:36'),
(170, '1309902628373', '2020-07-08 07:02:36'),
(171, '1309902628373', '2020-07-08 07:02:36'),
(172, '1309902628373', '2020-07-08 07:02:36'),
(173, '1309902628373', '2020-07-08 07:02:36'),
(174, '1309902628373', '2020-07-08 07:02:36'),
(175, '1309902628373', '2020-07-08 07:02:36'),
(176, '1309902628373', '2020-07-08 07:02:36'),
(177, '1309902628373', '2020-07-08 07:02:36'),
(178, '1309902628373', '2020-07-08 07:02:36'),
(179, '1309902628373', '2020-07-08 07:02:36'),
(180, '1309902628373', '2020-07-09 07:02:36'),
(181, '1309902628373', '2020-07-09 07:02:36'),
(182, '1309902628373', '2020-07-09 07:02:36'),
(183, '1309902628373', '2020-07-09 07:02:36'),
(184, '1309902628373', '2020-07-09 07:02:36'),
(185, '1309902628372', '2020-07-09 07:02:36'),
(186, '1309902628372', '2020-08-09 07:02:36'),
(187, '1309902628372', '2020-08-09 07:02:36'),
(188, '1309902628372', '2020-08-09 07:02:36'),
(189, '1309902628372', '2020-08-09 07:02:36'),
(190, '1309902628372', '2020-08-09 07:02:36'),
(191, '1309902628372', '2020-08-09 07:02:36'),
(192, '1309902628372', '2020-08-09 07:02:36'),
(193, '1309902628372', '2020-08-09 07:02:36'),
(194, '1309902628372', '2020-08-10 07:02:36'),
(195, '1309902628372', '2020-08-10 07:02:36'),
(196, '1309902628372', '2020-08-10 07:02:36'),
(197, '1309902628372', '2020-08-10 07:02:36'),
(198, '1309902628372', '2020-08-10 07:02:36'),
(199, '1309902628372', '2020-08-10 07:02:36'),
(200, '1309902628372', '2020-08-10 07:02:36'),
(201, '1309902628372', '2020-08-10 07:02:36'),
(202, '1309902628372', '2020-08-10 07:02:36'),
(203, '1309902628372', '2020-08-10 07:02:36'),
(204, '1309902628371', '2020-08-10 07:02:36'),
(205, '1309902628371', '2020-08-10 07:02:36'),
(206, '1309902628371', '2020-08-10 07:02:36'),
(207, '1309902628371', '2020-08-10 07:02:36'),
(208, '1309902628371', '2020-08-10 07:02:36'),
(209, '1309902628371', '2020-08-11 07:02:36'),
(210, '1309902628371', '2020-08-11 07:02:36'),
(211, '1309902628371', '2020-08-11 07:02:36'),
(212, '1309902628371', '2020-08-11 07:02:36'),
(213, '1309902628371', '2020-08-11 07:02:36'),
(214, '1309902628371', '2020-09-11 07:02:36'),
(215, '1309902628371', '2020-09-11 07:02:36'),
(216, '1309902628371', '2020-09-11 07:02:36'),
(217, '1309902628371', '2020-09-11 07:02:36'),
(218, '1309902628371', '2020-09-12 07:02:36'),
(219, '1309902628371', '2020-09-13 07:02:36'),
(220, '1309902628371', '2020-09-14 07:02:36'),
(221, '1309902628371', '2020-09-15 07:02:36'),
(222, '1309902628371', '2020-09-16 07:02:36'),
(223, '1309902628372', '2019-09-17 07:02:36'),
(224, '1309902628372', '2019-09-18 07:02:36'),
(225, '1309902628372', '2019-09-19 07:02:36'),
(226, '1309902628372', '2019-09-20 07:02:36'),
(227, '1309902628372', '2019-09-21 07:02:36'),
(228, '1309902628372', '2019-09-21 07:02:36'),
(229, '1309902628372', '2019-09-21 07:02:36'),
(230, '1309902628372', '2019-09-21 07:02:36'),
(231, '1309902628372', '2019-09-21 07:02:36'),
(232, '1309902628372', '2019-09-21 07:02:36'),
(233, '1309902628372', '2019-09-21 07:02:36'),
(234, '1309902628372', '2019-09-21 07:02:36'),
(235, '1309902628372', '2019-09-21 07:02:36'),
(236, '1309902628372', '2019-09-21 07:02:36'),
(237, '1309902628372', '2019-09-21 07:02:36'),
(238, '1309902628372', '2019-09-21 07:02:36'),
(239, '1309902628372', '2019-09-25 07:02:36'),
(240, '1309902628372', '2019-09-26 07:02:36'),
(241, '1309902628372', '2019-09-26 07:02:36'),
(242, '1309902628371', '2019-09-26 07:02:36'),
(243, '1309902628371', '2019-09-26 07:02:36'),
(244, '1309902628371', '2019-09-26 07:02:36'),
(245, '1309902628371', '2019-09-26 07:02:36'),
(246, '1309902628371', '2019-09-26 07:02:36'),
(247, '1309902628371', '2019-09-27 07:02:36'),
(248, '1309902628371', '2019-10-27 07:02:36'),
(249, '1309902628371', '2019-10-27 07:02:36'),
(250, '1309902628371', '2019-10-27 07:02:36'),
(251, '1309902628371', '2019-10-27 07:02:36'),
(252, '1309902628371', '2019-10-28 07:02:36'),
(253, '1309902628371', '2019-10-29 07:02:36'),
(254, '1309902628371', '2019-10-29 07:02:36'),
(255, '1309902628371', '2019-10-29 07:02:36'),
(256, '1309902628371', '2019-10-30 07:02:36'),
(257, '1309902628376', '2020-09-05 14:09:51'),
(258, '1309902628376', '2020-09-05 14:10:49');

-- --------------------------------------------------------

--
-- Table structure for table `employee`
--

CREATE TABLE `employee` (
  `id` int(3) NOT NULL,
  `ssn` char(39) NOT NULL,
  `fname` varchar(300) NOT NULL,
  `lname` varchar(300) NOT NULL,
  `username` varchar(150) NOT NULL,
  `password` varchar(60) NOT NULL,
  `phone` char(30) NOT NULL,
  `jobtitle` varchar(150) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee`
--

INSERT INTO `employee` (`id`, `ssn`, `fname`, `lname`, `username`, `password`, `phone`, `jobtitle`) VALUES
(28, '1309902628375', 'โยธิน', 'ช่องผักแว่น', 'yothin', '$2y$10$HPP/m9gdtnTaBtjcARLW5.YheZ7eM3mM4lOFDzt/PK4OuXWBVyKQW', '0935538303', 'เจ้าของร้าน'),
(29, '1100280006940', 'ชัยธวัช', 'น้อมพุดซา', 'chaitawat', '$2y$10$gnGLk//5dOu9T1QnXXdWpOoXisqPFG/6eMgdkYXmQq01ZcCslnoOu', '0839348581', 'เจ้าของร้าน'),
(30, '1309902029272', 'จีรวัฒน์', 'แทนไธสง', 'jeerawat', '$2y$10$P8Np5STGi7Q3ChqKA/oEQ.Zyyj4uJUkKTIyjLGPfsWcd9LvTO/ja.', '0987676589', 'พนักงาน'),
(31, '1109890254536', 'ชัชวาลย์', 'น้อมพุดซา', 'chatchawan', '$2y$10$QO1UI6WR5T/KI9l0R5W7LeD91717TQ.kRvnGF6UM6IEftpvsW.bZe', '0917658473', 'พนักงาน'),
(32, '1302948576859', 'ศิริวิริยา', 'หมื่นฤทธิ์', 'siriwiriya', '$2y$10$m6GmGS7K/A9V2UmLxkxU/eAAHrcZqlX4.MsuFLJz9eM1.1NEExuB6', '0867546378', 'พนักงาน');

-- --------------------------------------------------------

--
-- Table structure for table `employee_jobtitle`
--

CREATE TABLE `employee_jobtitle` (
  `id` int(11) UNSIGNED NOT NULL,
  `name_jobtitle` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `employee_jobtitle`
--

INSERT INTO `employee_jobtitle` (`id`, `name_jobtitle`) VALUES
(1, 'เจ้าของร้าน'),
(2, 'พนักงาน');

-- --------------------------------------------------------

--
-- Table structure for table `employee_login`
--

CREATE TABLE `employee_login` (
  `id` int(11) NOT NULL,
  `username_emp` varchar(64) DEFAULT NULL,
  `login_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `logout_time` datetime DEFAULT NULL,
  `details` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `log_setting`
--

CREATE TABLE `log_setting` (
  `id` int(11) UNSIGNED NOT NULL,
  `username_emp` varchar(50) NOT NULL,
  `login_time` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `details` text NOT NULL,
  `login_from` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `radacct`
--

CREATE TABLE `radacct` (
  `radacctid` bigint(21) NOT NULL,
  `acctsessionid` varchar(64) NOT NULL DEFAULT '',
  `acctuniqueid` varchar(32) NOT NULL DEFAULT '',
  `username` varchar(64) NOT NULL DEFAULT '',
  `realm` varchar(64) DEFAULT '',
  `nasipaddress` varchar(15) NOT NULL DEFAULT '',
  `nasportid` varchar(15) DEFAULT NULL,
  `nasporttype` varchar(32) DEFAULT NULL,
  `acctstarttime` datetime DEFAULT NULL,
  `acctupdatetime` datetime DEFAULT NULL,
  `acctstoptime` datetime DEFAULT NULL,
  `acctinterval` int(12) DEFAULT NULL,
  `acctsessiontime` int(12) UNSIGNED DEFAULT NULL,
  `acctauthentic` varchar(32) DEFAULT NULL,
  `connectinfo_start` varchar(50) DEFAULT NULL,
  `connectinfo_stop` varchar(50) DEFAULT NULL,
  `acctinputoctets` bigint(20) DEFAULT NULL,
  `acctoutputoctets` bigint(20) DEFAULT NULL,
  `calledstationid` varchar(50) NOT NULL DEFAULT '',
  `callingstationid` varchar(50) NOT NULL DEFAULT '',
  `acctterminatecause` varchar(32) NOT NULL DEFAULT '',
  `servicetype` varchar(32) DEFAULT NULL,
  `framedprotocol` varchar(32) DEFAULT NULL,
  `framedipaddress` varchar(15) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `radcheck`
--

CREATE TABLE `radcheck` (
  `id` int(11) UNSIGNED NOT NULL,
  `username` varchar(64) CHARACTER SET utf8mb4 NOT NULL DEFAULT '',
  `attribute` varchar(64) CHARACTER SET utf8mb4 NOT NULL DEFAULT '',
  `op` char(2) CHARACTER SET utf8mb4 NOT NULL DEFAULT '==',
  `value` varchar(253) CHARACTER SET utf8mb4 NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=ascii;

--
-- Dumping data for table `radcheck`
--

INSERT INTO `radcheck` (`id`, `username`, `attribute`, `op`, `value`) VALUES
(1, 'yothin', 'Cleartext-Password', '==', 'asdf1234'),
(2, 'jeerawat', 'NT-Password', ':=', '7CE21F17C0AEE7FB9CEBA532D0546AD6'),
(3, 'jeerawat', 'LM-Password', ':=', 'B757BF5C0D87772FAAD3B435B51404EE'),
(4, 'yo', 'Cleartext-Password', '==', 'asdf1234'),
(5, 'cpe', 'NT-Password', ':=', '6314EE354DE4B501F0C4C2F65D9AB991'),
(6, 'cpe', 'LM-Password', ':=', 'C3061D5AD48D8859AAD3B435B51404EE');

-- --------------------------------------------------------

--
-- Table structure for table `radreply`
--

CREATE TABLE `radreply` (
  `id` int(11) UNSIGNED NOT NULL,
  `username` varchar(64) NOT NULL DEFAULT '',
  `attribute` varchar(64) NOT NULL DEFAULT '',
  `op` char(2) NOT NULL DEFAULT '=',
  `value` varchar(253) NOT NULL DEFAULT ''
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- Table structure for table `setting`
--

CREATE TABLE `setting` (
  `id` int(11) NOT NULL,
  `attribute` varchar(100) DEFAULT NULL,
  `values` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `setting`
--

INSERT INTO `setting` (`id`, `attribute`, `values`) VALUES
(1, 'name_cafe', 'CPE_Cafe'),
(2, 'wifi_open', '08.00'),
(3, 'wifi_close', '16.00');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `customer`
--
ALTER TABLE `customer`
  ADD PRIMARY KEY (`ssn`);

--
-- Indexes for table `customer_register`
--
ALTER TABLE `customer_register`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employee`
--
ALTER TABLE `employee`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employee_jobtitle`
--
ALTER TABLE `employee_jobtitle`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employee_login`
--
ALTER TABLE `employee_login`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `log_setting`
--
ALTER TABLE `log_setting`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `radacct`
--
ALTER TABLE `radacct`
  ADD PRIMARY KEY (`radacctid`),
  ADD UNIQUE KEY `acctuniqueid` (`acctuniqueid`),
  ADD KEY `username` (`username`),
  ADD KEY `framedipaddress` (`framedipaddress`),
  ADD KEY `acctsessionid` (`acctsessionid`),
  ADD KEY `acctsessiontime` (`acctsessiontime`),
  ADD KEY `acctstarttime` (`acctstarttime`),
  ADD KEY `acctinterval` (`acctinterval`),
  ADD KEY `acctstoptime` (`acctstoptime`),
  ADD KEY `nasipaddress` (`nasipaddress`);

--
-- Indexes for table `radcheck`
--
ALTER TABLE `radcheck`
  ADD PRIMARY KEY (`id`),
  ADD KEY `username` (`username`(32));

--
-- Indexes for table `radreply`
--
ALTER TABLE `radreply`
  ADD PRIMARY KEY (`id`),
  ADD KEY `username` (`username`(32));

--
-- Indexes for table `setting`
--
ALTER TABLE `setting`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `customer_register`
--
ALTER TABLE `customer_register`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=259;

--
-- AUTO_INCREMENT for table `employee`
--
ALTER TABLE `employee`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;

--
-- AUTO_INCREMENT for table `employee_jobtitle`
--
ALTER TABLE `employee_jobtitle`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `employee_login`
--
ALTER TABLE `employee_login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `log_setting`
--
ALTER TABLE `log_setting`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `radacct`
--
ALTER TABLE `radacct`
  MODIFY `radacctid` bigint(21) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `radcheck`
--
ALTER TABLE `radcheck`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `radreply`
--
ALTER TABLE `radreply`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `setting`
--
ALTER TABLE `setting`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
